#ifndef __IWDG_H
#define __IWDG_H
#include "sys.h"
//////////////////////////////////////////////////////////////////////////////////     
//±¾³ÌĞòÖ»¹©Ñ§Ï°Ê¹ÓÃ£¬Î´¾­×÷ÕßĞí¿É£¬²»µÃÓÃÓÚÆäËüÈÎºÎÓÃÍ¾
//ALIENTEK STM32F407¿ª·¢°å
//¶ÀÁ¢¿´ÃÅ¹    Çı¶¯´úÂë	   
//ÕıµãÔ­×Ó@ALIENTEK
//¼¼ÊõÂÛÌ³:www.openedv.com
//´´½¨ÈÕÆÚ:2017/4/7
//°æ±¾£ºV1.0
//°æÈ¨ËùÓĞ£¬µÁ°æ±Ø¾¿¡£
//Copyright(C) ¹ãÖİÊĞĞÇÒíµç×Ó¿Æ¼¼ÓĞÏŞ¹«Ë¾ 2014-2024
//All rights reserved                                      
//////////////////////////////////////////////////////////////////////////////////     

void IWDG_Init(uint8_t prer,uint16_t rlr);//³õÊ¼»¯IWDG£¬²¢Ê¹ÄÜIWDG
void IWDG_Feed(void);//Î¹¹·
#endif
